import streamlit as st
from math import pi

st.header("Расчет крепежа на прочность.")

screw = {
    "M3": 2.675,  # Шаг 0.5 мм
    "M4": 3.545,  # Шаг 0.7 мм
    "M5": 4.480,  # Шаг 0.8 мм
    "M6": 5.350,  # Шаг 1.0 мм
    "M8": 7.188,  # Шаг 1.25 мм
    "M10": 9.026,  # Шаг 1.5 мм
    "M12": 10.863,  # Шаг 1.75 мм
    "M14": 12.701,  # Шаг 2.0 мм
    "M16": 14.701,  # Шаг 2.0 мм
    "M18": 16.376,  # Шаг 2.5 мм
    "M20": 18.376,  # Шаг 2.5 мм
    "M22": 20.376,  # Шаг 2.5 мм
    "M24": 22.051,  # Шаг 3.0 мм
    "M27": 25.051,  # Шаг 3.0 мм
    "M30": 27.727,  # Шаг 3.5 мм
}

pressure = (
    st.number_input("Введите избыточное давление в МПа", min_value=0.0, value=10.0)
) * 10**6  # MPa to Pa

D = (
    st.number_input(
        "Введите наружный диаметр поверхности на которую воздействует давление, мм",
        min_value=1,
        value=100,
    )
) / 1000

d = (
    st.number_input(
        "Введите внутренний диаметр поверхности на которую воздействует давление, в случае давления на полную площадь оставьте 0, мм",
        min_value=0.0,
        max_value=D,
    )
) / 1000

n = st.number_input("Введите количесвто винтов/болтов", min_value=1)
force = pi * (D**2 - d**2) / 4 * pressure / n

strength = st.selectbox(
    "Выберите класс прочности крепежа",
    ("A2-70", "A4-70", "3.6", "4.6", "5.8", "8.8", "9.8", "10.9", "12.9"),
    index=5,
)

if strength == "A2-70" or strength == "A4-70":
    strength = 700
else:
    s1, s2 = strength.split(".")
    strength = int(s1) * int(s2) * 10

screw_size = st.selectbox(
    "Выберите диаметр резьбы",
    screw.keys(),
    index=5,
)

area = pi * screw[screw_size] ** 2 / 4
f = area * strength

k = round(f / force, 1)

if k <= 1:
    st.error(
        f"Эксплуатация запрещена. Коэффициент запаса прочности {k} < 1.",
        icon="🚨",
    )
elif k <= 2:
    st.warning(
        f"Эксплуатация не рекомендуется. Коэффициент запаса прочности {k} < 2.",
        icon="⚠️",
    )
else:
    st.success(
        f"Эксплуатация разрешена. Коэффициент запаса прочности {k} > 2.", icon="✅"
    )
